lkolbly/cmsis-svd/data/Cypress/S6E2C3.svd
        <!-- REGISTER "PFRA" -->
        <register>
          <name>PFRA</name>
          <description>32</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PAF" -->
            <field>
              <name>PAF</name>
              <description>Bit15 of PFRA</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAE" -->
            <field>
              <name>PAE</name>
              <description>Bit14 of PFRA</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAD" -->
            <field>
              <name>PAD</name>
              <description>Bit13 of PFRA</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAC" -->
            <field>
              <name>PAC</name>
              <description>Bit12 of PFRA</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAB" -->
            <field>
              <name>PAB</name>
              <description>Bit11 of PFRA</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAA" -->
            <field>
              <name>PAA</name>
              <description>Bit10 of PFRA</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA9" -->
            <field>
              <name>PA9</name>
              <description>Bit9 of PFRA</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA8" -->
            <field>
              <name>PA8</name>
              <description>Bit8 of PFRA</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA7" -->
            <field>
              <name>PA7</name>
              <description>Bit7 of PFRA</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA6" -->
            <field>
              <name>PA6</name>
              <description>Bit6 of PFRA</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA5" -->
            <field>
              <name>PA5</name>
              <description>Bit5 of PFRA</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA4" -->
            <field>
              <name>PA4</name>
              <description>Bit4 of PFRA</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA3" -->
            <field>
              <name>PA3</name>
              <description>Bit3 of PFRA</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA2" -->
            <field>
              <name>PA2</name>
              <description>Bit2 of PFRA</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA1" -->
            <field>
              <name>PA1</name>
              <description>Bit1 of PFRA</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA0" -->
            <field>
              <name>PA0</name>
              <description>Bit0 of PFRA</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRB" -->
        <register>
          <name>PFRB</name>
          <description>32</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PBF" -->
            <field>
              <name>PBF</name>
              <description>Bit15 of PFRB</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBE" -->
            <field>
              <name>PBE</name>
              <description>Bit14 of PFRB</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBD" -->
            <field>
              <name>PBD</name>
              <description>Bit13 of PFRB</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBC" -->
            <field>
              <name>PBC</name>
              <description>Bit12 of PFRB</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBB" -->
            <field>
              <name>PBB</name>
              <description>Bit11 of PFRB</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBA" -->
            <field>
              <name>PBA</name>
              <description>Bit10 of PFRB</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB9" -->
            <field>
              <name>PB9</name>
              <description>Bit9 of PFRB</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB8" -->
            <field>
              <name>PB8</name>
              <description>Bit8 of PFRB</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB7" -->
            <field>
              <name>PB7</name>
              <description>Bit7 of PFRB</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB6" -->
            <field>
              <name>PB6</name>
              <description>Bit6 of PFRB</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB5" -->
            <field>
              <name>PB5</name>
              <description>Bit5 of PFRB</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB4" -->
            <field>
              <name>PB4</name>
              <description>Bit4 of PFRB</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB3" -->
            <field>
              <name>PB3</name>
              <description>Bit3 of PFRB</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB2" -->
            <field>
              <name>PB2</name>
              <description>Bit2 of PFRB</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB1" -->
            <field>
              <name>PB1</name>
              <description>Bit1 of PFRB</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB0" -->
            <field>
              <name>PB0</name>
              <description>Bit0 of PFRB</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRC" -->
        <register>
          <name>PFRC</name>
          <description>32</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PCF" -->
            <field>
              <name>PCF</name>
              <description>Bit15 of PFRC</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCE" -->
            <field>
              <name>PCE</name>
              <description>Bit14 of PFRC</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCD" -->
            <field>
              <name>PCD</name>
              <description>Bit13 of PFRC</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCC" -->
            <field>
              <name>PCC</name>
              <description>Bit12 of PFRC</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCB" -->
            <field>
              <name>PCB</name>
              <description>Bit11 of PFRC</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCA" -->
            <field>
              <name>PCA</name>
              <description>Bit10 of PFRC</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC9" -->
            <field>
              <name>PC9</name>
              <description>Bit9 of PFRC</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC8" -->
            <field>
              <name>PC8</name>
              <description>Bit8 of PFRC</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC7" -->
            <field>
              <name>PC7</name>
              <description>Bit7 of PFRC</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC6" -->
            <field>
              <name>PC6</name>
              <description>Bit6 of PFRC</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC5" -->
            <field>
              <name>PC5</name>
              <description>Bit5 of PFRC</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC4" -->
            <field>
              <name>PC4</name>
              <description>Bit4 of PFRC</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC3" -->
            <field>
              <name>PC3</name>
              <description>Bit3 of PFRC</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC2" -->
            <field>
              <name>PC2</name>
              <description>Bit2 of PFRC</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC1" -->
            <field>
              <name>PC1</name>
              <description>Bit1 of PFRC</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC0" -->
            <field>
              <name>PC0</name>
              <description>Bit0 of PFRC</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRD" -->
        <register>
          <name>PFRD</name>
          <description>32</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PD2" -->
            <field>
              <name>PD2</name>
              <description>Bit2 of PFRD</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD1" -->
            <field>
              <name>PD1</name>
              <description>Bit1 of PFRD</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD0" -->
            <field>
              <name>PD0</name>
              <description>Bit0 of PFRD</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description>Port Function Setting Register E</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description>Bit3 of PFRE</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description>Bit2 of PFRE</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description>Bit0 of PFRE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
