lkolbly/cmsis-svd/data/Cypress/S6E2C3.svd
        <!-- REGISTER "DMSTOP" -->
        <register>
          <name>DMSTOP</name>
          <description>Direct Mode Transfer Stop Control Register</description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STOP" -->
            <field>
              <name>STOP</name>
              <description>Transfer stop bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMPSEL" -->
        <register>
          <name>DMPSEL</name>
          <description>Direct Mode Slave Select Register</description>
          <addressOffset>0x3A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>Peripheral select bits</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMTRP" -->
        <register>
          <name>DMTRP</name>
          <description>Direct Mode Transfer Protocol Setting Register</description>
          <addressOffset>0x3B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>Transfer protocol setting bits</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMBCC" -->
        <register>
          <name>DMBCC</name>
          <description>Direct Mode Transfer Byte Count Setting Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BCC" -->
            <field>
              <name>BCC</name>
              <description>Transferred byte count setting value</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMBCS" -->
        <register>
          <name>DMBCS</name>
          <description>Direct Mode Transfer Remaining Count Register</description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BCS" -->
            <field>
              <name>BCS</name>
              <description>Number of remaining bytes to transfer</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMSTATUS" -->
        <register>
          <name>DMSTATUS</name>
          <description>Direct Mode Status Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001F1F03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXFLEVEL" -->
            <field>
              <name>TXFLEVEL</name>
              <description>Remaining TX-FIFO data indication bits</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXFLEVEL" -->
            <field>
              <name>RXFLEVEL</name>
              <description>Remaining RX-FIFO data indication bits</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXACTIVE" -->
            <field>
              <name>TXACTIVE</name>
              <description>Transmission status bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXACTIVE" -->
            <field>
              <name>RXACTIVE</name>
              <description>Reception status bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FIFOCFG" -->
        <register>
          <name>FIFOCFG</name>
          <description>FIFO Setting Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000077</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXFLSH" -->
            <field>
              <name>TXFLSH</name>
              <description>TX-FIFO clear bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RXFLSH" -->
            <field>
              <name>RXFLSH</name>
              <description>RX-FIFO clear bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TXCTRL" -->
            <field>
              <name>TXCTRL</name>
              <description>TX-FIFO transmission data control bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FWIDTH" -->
            <field>
              <name>FWIDTH</name>
              <description>FIFO bit width setting value</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFTH" -->
            <field>
              <name>TXFTH</name>
              <description>TX-FIFO threshold</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFTH" -->
            <field>
              <name>RXFTH</name>
              <description>RX-FIFO threshold</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFIFO0" -->
        <register>
          <name>TXFIFO0</name>
          <description>TX-FIFO0 Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description>TX-FIFO0 write data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFIFO1" -->
        <register derivedFrom="TXFIFO0">
          <name>TXFIFO1</name>
          <description>TX-FIFO1 Register</description>
          <addressOffset>0x54</addressOffset>
        </register>
